{
    "vision_config": {
        "vision_config": {
            "return_dict": true,
            "output_hidden_states": false,
            "torchscript": false,
            "torch_dtype": null,
            "use_bfloat16": false,
            "tf_legacy_loss": false,
            "pruned_heads": {},
            "tie_word_embeddings": true,
            "chunk_size_feed_forward": 0,
            "is_encoder_decoder": false,
            "is_decoder": false,
            "cross_attention_hidden_size": null,
            "add_cross_attention": false,
            "tie_encoder_decoder": false,
            "max_length": 20,
            "min_length": 0,
            "do_sample": false,
            "early_stopping": false,
            "num_beams": 1,
            "num_beam_groups": 1,
            "diversity_penalty": 0.0,
            "temperature": 1.0,
            "top_k": 50,
            "top_p": 1.0,
            "typical_p": 1.0,
            "repetition_penalty": 1.0,
            "length_penalty": 1.0,
            "no_repeat_ngram_size": 0,
            "encoder_no_repeat_ngram_size": 0,
            "bad_words_ids": null,
            "num_return_sequences": 1,
            "output_scores": false,
            "return_dict_in_generate": false,
            "forced_bos_token_id": null,
            "forced_eos_token_id": null,
            "remove_invalid_values": false,
            "exponential_decay_length_penalty": null,
            "suppress_tokens": null,
            "begin_suppress_tokens": null,
            "architectures": [
                "KeyeVL1_5VisionModel"
            ],
            "finetuning_task": null,
            "id2label": {
                "0": "LABEL_0",
                "1": "LABEL_1"
            },
            "label2id": {
                "LABEL_0": 0,
                "LABEL_1": 1
            },
            "tokenizer_class": null,
            "prefix": null,
            "bos_token_id": null,
            "pad_token_id": null,
            "eos_token_id": null,
            "sep_token_id": null,
            "decoder_start_token_id": null,
            "task_specific_params": null,
            "problem_type": null,
            "_name_or_path": "",
            "auto_map": {
                "AutoConfig": "configuration_keye_vl_1_5.KeyeVL1_5VisionConfig",
                "AutoModel": "modeling_keye_vl_1_5.KeyeVL1_5VisionModel"
            },
            "dtype": "bfloat16",
            "has_learnable_position_embedding": true,
            "model_type": "Keye",
            "rope_theta": 10000,
            "hidden_size": 1152,
            "intermediate_size": 4304,
            "num_hidden_layers": 27,
            "num_attention_heads": 16,
            "num_channels": 3,
            "patch_size": 14,
            "image_size": 384,
            "attention_dropout": 0.0,
            "layer_norm_eps": 1e-06,
            "hidden_act": "gelu_pytorch_tanh",
            "spatial_merge_size": 2,
            "temporal_patch_size": 2,
            "tokens_per_second": 2,
            "output_attentions": false
        },
        "decoder_config": {
            "return_dict": true,
            "output_hidden_states": false,
            "torchscript": false,
            "torch_dtype": null,
            "use_bfloat16": false,
            "tf_legacy_loss": false,
            "pruned_heads": {},
            "tie_word_embeddings": true,
            "chunk_size_feed_forward": 0,
            "is_encoder_decoder": false,
            "is_decoder": false,
            "cross_attention_hidden_size": null,
            "add_cross_attention": false,
            "tie_encoder_decoder": false,
            "max_length": 20,
            "min_length": 0,
            "do_sample": false,
            "early_stopping": false,
            "num_beams": 1,
            "num_beam_groups": 1,
            "diversity_penalty": 0.0,
            "temperature": 1.0,
            "top_k": 50,
            "top_p": 1.0,
            "typical_p": 1.0,
            "repetition_penalty": 1.0,
            "length_penalty": 1.0,
            "no_repeat_ngram_size": 0,
            "encoder_no_repeat_ngram_size": 0,
            "bad_words_ids": null,
            "num_return_sequences": 1,
            "output_scores": false,
            "return_dict_in_generate": false,
            "forced_bos_token_id": null,
            "forced_eos_token_id": null,
            "remove_invalid_values": false,
            "exponential_decay_length_penalty": null,
            "suppress_tokens": null,
            "begin_suppress_tokens": null,
            "architectures": [
                "KeyeVL1_5VisionModel"
            ],
            "finetuning_task": null,
            "id2label": {
                "0": "LABEL_0",
                "1": "LABEL_1"
            },
            "label2id": {
                "LABEL_0": 0,
                "LABEL_1": 1
            },
            "tokenizer_class": null,
            "prefix": null,
            "bos_token_id": null,
            "pad_token_id": null,
            "eos_token_id": null,
            "sep_token_id": null,
            "decoder_start_token_id": null,
            "task_specific_params": null,
            "problem_type": null,
            "_name_or_path": "",
            "dtype": "bfloat16",
            "has_learnable_position_embedding": true,
            "model_type": "Keye",
            "rope_theta": 10000,
            "hidden_size": 128,
            "intermediate_size": 384,
            "num_hidden_layers": 3,
            "num_attention_heads": 8,
            "num_channels": 3,
            "patch_size": 14,
            "image_size": 224,
            "attention_dropout": 0.0,
            "layer_norm_eps": 1e-06,
            "hidden_act": "gelu_pytorch_tanh",
            "spatial_merge_size": 2,
            "temporal_patch_size": 2,
            "tokens_per_second": 2,
            "output_attentions": false
        },
        "split_dim": false,
        "codebook_size": 65536,
        "embedding_dim": 128,
        "init_embedding_dim": 4096,
        "llm_hidden_size": 4096,
        "n_q_tokens": 8,
        "merge_size": 2,
        "spatial_merge_size": 2,
        "add_voc_reducer": false,
        "split_voc": 8,
        "return_dict": true,
        "output_hidden_states": false,
        "torchscript": false,
        "torch_dtype": null,
        "use_bfloat16": false,
        "tf_legacy_loss": false,
        "pruned_heads": {},
        "tie_word_embeddings": true,
        "chunk_size_feed_forward": 0,
        "is_encoder_decoder": false,
        "is_decoder": false,
        "cross_attention_hidden_size": null,
        "add_cross_attention": false,
        "tie_encoder_decoder": false,
        "max_length": 20,
        "min_length": 0,
        "do_sample": false,
        "early_stopping": false,
        "num_beams": 1,
        "num_beam_groups": 1,
        "diversity_penalty": 0.0,
        "temperature": 1.0,
        "top_k": 50,
        "top_p": 1.0,
        "typical_p": 1.0,
        "repetition_penalty": 1.0,
        "length_penalty": 1.0,
        "no_repeat_ngram_size": 0,
        "encoder_no_repeat_ngram_size": 0,
        "bad_words_ids": null,
        "num_return_sequences": 1,
        "output_scores": false,
        "return_dict_in_generate": false,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "remove_invalid_values": false,
        "exponential_decay_length_penalty": null,
        "suppress_tokens": null,
        "begin_suppress_tokens": null,
        "architectures": [
            "KeyeImageTokenizer"
        ],
        "finetuning_task": null,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "tokenizer_class": null,
        "prefix": null,
        "bos_token_id": null,
        "pad_token_id": null,
        "eos_token_id": null,
        "sep_token_id": null,
        "decoder_start_token_id": null,
        "task_specific_params": null,
        "problem_type": null,
        "_name_or_path": "/llm_reco_ssd/zhouyang12/models/KeyeImageTokenizer_init_raw/",
        "dtype": "bfloat16",
        "model_type": "KeyeImageTokenizer",
        "output_attentions": false
    },
    "attention_bias": false,
    "vocab_size": 151936,
    "max_position_embeddings": 40960,
    "hidden_size": 4096,
    "intermediate_size": 12288,
    "num_hidden_layers": 36,
    "num_attention_heads": 32,
    "use_sliding_window": false,
    "sliding_window": null,
    "max_window_layers": 36,
    "num_key_value_heads": 8,
    "hidden_act": "silu",
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-06,
    "use_cache": true,
    "rope_theta": 1000000,
    "attention_dropout": 0.0,
    "rope_scaling": {
        "mrope_section": [
            16,
            24,
            24
        ],
        "rope_type": "default",
        "type": "default"
    },
    "return_dict": true,
    "output_hidden_states": false,
    "torchscript": false,
    "torch_dtype": "float32",
    "use_bfloat16": false,
    "tf_legacy_loss": false,
    "pruned_heads": {},
    "tie_word_embeddings": false,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "architectures": [
        "KeyeForConditionalGeneration"
    ],
    "finetuning_task": null,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
    },
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
    },
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": 151643,
    "pad_token_id": null,
    "eos_token_id": 151645,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "task_specific_params": null,
    "problem_type": null,
    "_name_or_path": "",
    "transformers_version": "4.53.0",
    "fast_video_token_id": 151678,
    "head_dim": 128,
    "image_token_id": 151655,
    "meta": "this model is init from Qwen3-8B(/llm_reco_ssd/zhouyang12/models/Qwen3-8B) and tokenizer_end2end_mt_1drope_v2(/mmu_mllm_hdd_2/zhouyang12/output/Keye/vq_end2end_1105/run_exp1.6.6109_stage3/step9500/global_step9500/converted_vqar)",
    "model_type": "Keye",
    "pool": "sum",
    "video_token_id": 151656,
    "vision_end_token_id": 151653,
    "vision_start_token_id": 151652,
    "vision_token_id": 151654,
    "ar_mode": "ar",
    "new_table": true,
    "pre_embedding_size": null,
    "pre_embedding_tokens": null,
    "original_hidden_size": 1024,
    "q_eos_token": 151681,
    "token_head_nhead": 4,
    "token_head_dim": 512,
    "token_head_intermediate_dim": 2048,
    "output_one_token": false,
    "output_attentions": false
}